---
kind: method
id: M:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.IsAnalysisCompleted
source: html/b3e54d65-dac8-50da-d25d-655e07b942ad.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.IsAnalysisCompleted Method

Indicates if the background systems analysis has completed or not.

## Syntax (C#)
```csharp
public bool IsAnalysisCompleted()
```

## Returns
True if completed, otherwise false.